"identhub_bank_establishing_connection_text" = "Établissement d’une connexion sécurisée avec votre banque en cours...";

"identhub_bank_iban_description" = "Veuillez saisir l\'IBAN de votre compte bancaire allemand. Malheureusement, les comptes joints ne sont pas supportés. Vos données sont chiffrées.";

"identhub_bank_iban_secured_text" = "Vos données sont chiffrées.";

"identhub_bank_iban_title" = "Entrez votre IBAN";

"identhub_bank_payment_verification_description" = "Continuer pour signer les documents et terminer votre processus d’identification.";

"identhub_bank_payment_verification_title" = "Vérification du paiement réussie";

"identhub_phone_transcation_detail_text" = "Votre ID de transaction est %1$s\nAssurez-vous qu’il s’agit du même SMS que celui que vous venez de recevoir.";

